# -*- coding: utf-8 -*-

import sqlite3
from sqlite3 import Error

def sql_connection():

    try:
        con = sqlite3.connect('db_discord_bot.db')

        return con
    
    except Error:
        print(Error)

def slq_create_table(con):

    cursorObj = con.cursor()
    try:
        cursorObj.execute('''
        CREATE TABLE team
        (
        id bigint primary key,
        creator_name varchar(100) not null,
        rtk_parm int not null,
        name varchar(100) not null,
        description varchar(1000) not null,
        team_role_id bigint not null,
        team_text_id bigint not null,
        team_voice_id bigint not null,
        team_category_id bigint not null
        )
        ''')
        con.commit()
    except Error as e:
        error_code = e.args[0]
        print(f'Create table team return error message: {error_code}')

    try:
        cursorObj.execute('''
        CREATE TABLE users
        (
        id bigint primary key,
        user_name varchar(100) not null,
        rating varchar(20) not null,
        rating_value int not null,
        role_1 varchar(10) not null,
        role_2 varchar(10) not null,
        role_3 varchar(10) not null,
        role_4 varchar(10) not null,
        role_5 varchar(10) not null,
        hz int,
        discord_name varchar(100) not null
        )
        ''')
        con.commit()
    except Error as e:
        error_code = e.args[0]
        print(f'Create table user return error message: {error_code}')

    try:
        cursorObj.execute('''
        CREATE TABLE user_to_team
        (
        id int primary key,
        id_user bigint not null,
        id_team bigint not null,
        role varchar(100) not null,
        foreign key (id_user) references user(id),
        foreign key (id_team) references team(id)
        )
        ''')
        con.commit()
    except Error as e:
        error_code = e.args[0]
        print(f'Create table user return error message: {error_code}')

    try:
        cursorObj.execute('''
        CREATE TABLE events
        (
        id bigint primary key,
        date_add datetime,
        date_start datetime,
        type varchar(20),
        event_name varchar(100),
        event_description varchar(5000),
        status int,
        id_event_role bigint,
        id_event_text_channel bigint,
        id_event_voice_channel bigint,
        id_event_category_channel bigint,
        id_role_team_arr varchar(5000),
        id_channel_team_arr varchar(5000)  
        )
        ''')
        con.commit()

    except Error as e:
        error_code = e.args[0]
        print(f'Create table events return error message: {error_code}')

    try:
        cursorObj.execute('''
        CREATE TABLE event_to_team
        (
        id int primary key,
        id_team bigint not null,
        id_event bigint not null,
        foreign key (id_team) references team(id),
        foreign key (id_event) references events(id)
        )
        ''')
        con.commit()

    except Error as e:
        error_code = e.args[0]
        print(f'Create table event_to_team return error message: {error_code}')

    try:
        cursorObj.execute('''
        CREATE TABLE error_mes
        (
        id int primary key,
        id_user bigint not null,
        channel varchar(200) not null,
        member varchar(200) not null,
        command varchar(200) not null,
        error varchar(200) not null,
        date_ad datetime 
        )
        ''')
        con.commit()

    except Error as e:
        error_code = e.args[0]
        print(f'Create table error_mes return error message: {error_code}')

    try:
        cursorObj.execute('''
        CREATE TABLE ban
        (
        ban_time datetime,
        end_ban_time datetime,
        resone varchar(2000),
        id_user bigint not null,
        foreign key (id_user) references user(id)
        )
        ''')
        con.commit()

    except Error as e:
        error_code = e.args[0]
        print(f'Create table ban return error message: {error_code}')

def sql_insert_user(con):

    cursorObj = con.cursor()

    try:
    
        cursorObj.execute('''INSERT INTO `users` VALUES (87830439460364288,'Fabio','Алмаз 2',2200,'Саппорт','Бот','Топ','Мид','Лес',0,'mexanic21'),(132211807241633792,'Genja007','Платина 2',1800,'Бот','Мид','Лес','Саппорт','Топ',0,'f0lloVVmE'),(141579934731599872,'FerociousBear','Серебро 2',1000,'Саппорт','Мид','Топ','Бот','Лес',0,'FerociousBear (Саня)'),(165167705425575936,'Skleon','Алмаз 4',2000,'Лес','Бот','Саппорт','Мид','Топ',0,'skleon'),(175103509908160512,'Юми','Серебро 2',1000,'Мид','Бот','Саппорт','Лес','Топ',0,'Yumi'),(178963010751168512,'ytrewq321','Платина 4',1600,'Саппорт','Топ','Лес','Мид','Бот',0,'suglinca'),(181008573927653376,'Ученик','Мастер+',2500,'Мид','Саппорт','Бот','Топ','Лес',0,'hellish2147'),(189708173236633600,'AsherPaws','Золото 2',1400,'Топ','Мид','Бот','Лес','Саппорт',0,'Кот-колдун'),(193875459757309952,'hiimfoxy','Платина 3',1700,'Мид','Топ','Лес','Бот','Саппорт',0,'imnikita'),(209355281874944001,'Irukandji1337','Алмаз 3',2100,'Топ','Саппорт','Мид','Лес','Бот',0,'Irukan'),(210884350902927361,'INNI Aurora','Алмаз 4',2000,'Саппорт','Лес','Мид','Топ','Бот',0,'aurorawatch'),(216963290117439488,'Ромчик','Алмаз 4',2000,'Саппорт','Топ','Мид','Лес','Бот',0,'Ромчик'),(219125130457120778,'Galqctik','Алмаз 3',2100,'Лес','Бот','Топ','Мид','Саппорт',0,'_moun'),(219763582114463744,'Дёня Животное','Железо 4',0,'Саппорт','Топ','Лес','Мид','Бот',0,'ZalmanZ9Plus'),(224616002749595649,'SeveR31','Алмаз 4',2000,'Бот','Мид','Саппорт','Лес','Топ',0,'Конская палка Соны'),(231419787543183360,'IRiseMoon','Мастер+',2500,'Саппорт','Мид','Бот','Топ','Лес',0,'irisemoon'),(236559691533123595,'Shangrilla','Золото 1',1500,'Лес','Мид','Саппорт','Топ','Бот',0,'Shangrilla'),(238715012116381700,'Gaalsien','Мастер+',2500,'Топ','Бот','Саппорт','Мид','Лес',0,'Rkaood'),(240165680782114817,'mistrbombastik','Алмаз 4',2000,'Лес','Саппорт','Бот','Топ','Мид',0,'sergrаy'),(243305694453825537,'balberchik','Серебро 4',800,'Мид','Саппорт','Топ','Бот','Лес',0,'ебля'),(249531630266482707,'Enfunsion','Мастер+',2500,'Бот','Топ','Мид','Саппорт','Лес',0,'enfunsion'),(252508236526256139,'G2 Hentai Ornn','Платина 2',1800,'Топ','Саппорт','Мид','Лес','Бот',0,'Deus Vult'),(252514308271898625,'Tinkoff Fad3Rn','Золото 4',1200,'Топ','Мид','Бот','Лес','Саппорт',0,'Дядя Шиза'),(255412017769218048,'Sarkaras','Бронза 4',400,'Саппорт','Лес','Топ','Бот','Мид',0,'Kronkvo'),(262518812841213953,'Leorinn','Золото 3',1300,'Саппорт','Мид','Бот','Топ','Лес',0,'Murrriya'),(268629190566215681,'Reaper','Серебро 2',1000,'Бот','Лес','Саппорт','Топ','Мид',0,'RCT Reaper'),(271993555164069890,'INNI Choppa','Мастер+',2500,'Мид','Топ','Лес','Бот','Саппорт',0,'bypomka'),(277851929780944896,'Венлафаксин','Серебро 2',1000,'Бот','Мид','Лес','Топ','Саппорт',0,'Тётя Шиза'),(282190950183469057,'МurМur','Платина 4',1600,'Бот','Мид','Саппорт','Лес','Топ',0,'Ненaвижу людей'),(282882184220770304,'Dragon of Shadow','Платина 2',1800,'Мид','Бот','Лес','Саппорт','Топ',0,'DragonDolbik'),(283223560754036737,'Negativ IQ MID','Платина 3',1700,'Саппорт','Мид','Лес','Бот','Топ',0,'ThrallSoD'),(284070185961390080,'BanKuYi ded','Алмаз 2',2200,'Лес','Бот','Топ','Мид','Саппорт',0,'BanKuYi ded'),(288322979908026368,'YonneOneLove','Алмаз 4',2000,'Топ','Мид','Бот','Лес','Саппорт',0,'YonneOneLove'),(291452265317924864,'Trinityfley','Платина 1',1900,'Саппорт','Топ','Мид','Лес','Бот',0,'FarseerKarma'),(293310291607945216,'IWantMyBlade','Мастер+',2500,'Топ','Мид','Бот','Саппорт','Лес',0,'INNI Blade'),(298472656401989634,'INNI Lacerta','Платина 1',1900,'Лес','Саппорт','Топ','Бот','Мид',0,'mnoize'),(307942161616207874,'Василь соляра','Золото 1',1500,'Топ','Бот','Мид','Саппорт','Лес',0,'Balvd'),(309020489228222465,'ufys','Платина 2',1800,'Саппорт','Мид','Топ','Бот','Лес',0,'ufys'),(312184593786601473,'Shtarmagedon','Серебро 1',1100,'Бот','Мид','Топ','Лес','Саппорт',0,'Shtarmagedon'),(313716866411397121,'Hentai Shaco','Платина 1',1900,'Бот','Саппорт','Лес','Топ','Мид',0,'Haul'),(315511180888113153,'Simbеlmynë','Алмаз 4',2000,'Мид','Бот','Лес','Саппорт','Топ',0,'Simbеlmynë'),(318814093584629760,'NotMello','Платина 3',1700,'Лес','Топ','Мид','Саппорт','Бот',0,'Markfromsky'),(318927755075125250,'SlayeR FANBOY','Платина 2',1800,'Мид','Топ','Лес','Бот','Саппорт',0,'Я Календарь'),(320286339079602177,'K1ndred','Платина 3',1700,'Лес','Топ','Мид','Бот','Саппорт',0,'Жижа'),(325879029141995520,'yata9','Мастер+',2500,'Бот','Саппорт','Топ','Мид','Лес',0,'yata9'),(335091359469928449,'mctilldan','Платина 1',1900,'Мид','Топ','Лес','Бот','Саппорт',0,'TILTDA'),(339362560526647296,'Pelmenlol','Серебро 1',1100,'Саппорт','Бот','Топ','Мид','Лес',0,'PelmenLol'),(342383845196300289,'Бугульмэн','Платина 2',1800,'Топ','Мид','Саппорт','Лес','Бот',0,'deusdan_n'),(347601471363350530,'DeathMamay','Золото 4',1200,'Мид','Саппорт','Лес','Бот','Топ',0,'DeathMamay'),(348292952067538945,'Vatroosha','Платина 4',1600,'Лес','Мид','Топ','Саппорт','Бот',0,'Batrosha'),(353916105020014592,'musor1dz3','Платина 1',1900,'Бот','Мид','Саппорт','Лес','Топ',0,'Sobaka(musor1dz3)'),(356863594987520001,'SMRage','Золото 4',1200,'Саппорт','Бот','Топ','Лес','Мид',0,'smrage'),(371956148896661504,'МамеПриветУе60к','Серебро 3',900,'Топ','Саппорт','Мид','Бот','Лес',0,'autistiolip'),(373903176237056012,'FlameNitor','Серебро 4',800,'Топ','Мид','Бот','Саппорт','Лес',0,'FlameNitor'),(385829798305595397,'NeoFox','Мастер+',2500,'Топ','Лес','Мид','Бот','Саппорт',0,'NeoFox'),(393837085049749504,'RETURN ТО MONKE','Алмаз 2',2200,'Топ','Бот','Мид','Саппорт','Лес',0,'twinkie43'),(404537095592345600,'Tрусики Шаи','Алмаз 4',2000,'Топ','Саппорт','Лес','Мид','Бот',0,'666amigo999'),(406026202135003147,'DollyNyan','Бронза 2',600,'Саппорт','Бот','Мид','Топ','Лес',0,'FoggyFroggy'),(407163703532978177,'MeaT1989','Бронза 4',400,'Бот','Лес','Топ','Саппорт','Мид',0,'Parl1k( Димас)'),(422267309042696202,'Аларик','Золото 2',1400,'Топ','Бот','Мид','Лес','Саппорт',0,'mexanic21'),(425878533470945282,'depressed king','Алмаз 1',2300,'Мид','Топ','Лес','Бот','Саппорт',0,'depressed kid L9'),(428229735667990528,'Milka02','Золото 1',1500,'Саппорт','Лес','Бот','Топ','Мид',0,'Milkka'),(434249954228436993,'VeoRomi','Платина 4',1600,'Мид','Топ','Бот','Лес','Саппорт',0,'VeoRomi'),(436206475656822785,'Not a Number','Серебро 1',1100,'Саппорт','Топ','Лес','Мид','Бот',0,'NaN Slave'),(441178893479575562,'Nae6kaDl9Uebka','Серебро 1',1100,'Мид','Топ','Саппорт','Бот','Лес',0,'Dnz'),(442594702387183626,'Точно не Шрек','Мастер+',2500,'Мид','Топ','Лес','Бот','Саппорт',0,'Точно не Шрек'),(444177351883096065,'Retrypal','Платина 1',1900,'Топ','Лес','Мид','Саппорт','Бот',0,'Биба плыл по морю...'),(445157781583036417,'ToxicDRAVEN','Платина 4',1600,'Бот','Лес','Саппорт','Топ','Мид',0,'Toxic'),(451310739899285514,'Tiranda Kin ','Серебро 1',1100,'Саппорт','Бот','Мид','Топ','Лес',0,'Виктория'),(451701267937624075,'Dumbеst','Серебро 2',1000,'Саппорт','Лес','Мид','Топ','Бот',0,'DUMBEST'),(455242436042817536,'Kryghownik','Бронза 3',500,'Саппорт','Лес','Бот','Топ','Мид',0,'Zoi Degurshaff'),(457780544797933568,'Daralont','Золото 2',1400,'Топ','Мид','Саппорт','Лес','Бот',0,'daralont'),(459334532223729685,'Alo','Платина 4',1600,'Топ','Лес','Мид','Бот','Саппорт',0,'Анало-говНет'),(460501040077340682,'Оливка Сайкса','Золото 3',1300,'Лес','Топ','Мид','Бот','Саппорт',0,'Киллер Кринж'),(462961618536628225,'MENMAO','Золото 3',1300,'Саппорт','Мид','Топ','Лес','Бот',0,'menmao'),(468838797409255425,'aaaa','Серебро 2',1000,'Мид','Топ','Лес','Бот','Саппорт',0,'э блять'),(469035000273305600,'babulehs fart','Алмаз 1',2300,'Топ','Лес','Мид','Бот','Саппорт',0,'babulehs fart'),(479546758477905921,'Demetra Berkut','Золото 4',1200,'Саппорт','Лес','Бот','Топ','Мид',0,'demetra'),(485011753374056449,'TeleK228','Мастер+',2500,'Мид','Саппорт','Лес','Топ','Бот',0,'telekxd'),(487620212410286089,'Gafinhord','Платина 3',1700,'Мид','Бот','Лес','Саппорт','Топ',0,'gafinhord'),(501076937314140161,'TechnoMouse','Алмаз 3',2100,'Бот','Мид','Топ','Саппорт','Лес',0,'TechnoMouse'),(506353278402166795,'Милый кицу','Платина 3',1700,'Мид','Топ','Бот','Лес','Саппорт',0,'Милая Кицу'),(507405342880169995,'DDGOD09','Золото 4',1200,'Бот','Саппорт','Топ','Лес','Мид',0,'DDGOD'),(508518977178173450,'Unbroken Kaito','Мастер+',2500,'Лес','Топ','Мид','Бот','Саппорт',0,'Unbroken Kaito'),(523141201952505856,'DеmonONI','Золото 4',1200,'Мид','Топ','Лес','Бот','Саппорт',0,'demononi'),(531953143995695104,'Хинкаль','Золото 4',1200,'Мид','Бот','Топ','Лес','Саппорт',0,'Sir'),(535513215245746179,'Yaddа','Платина 3',1700,'Лес','Топ','Мид','Саппорт','Бот',0,'yadda_and_willump'),(536915548873949194,'Ugandan','Железо 1',300,'Топ','Бот','Мид','Саппорт','Лес',0,'Шланг Цунг'),(540953171368083457,'KillerZera21','Серебро 2',1000,'Топ','Мид','Лес','Бот','Саппорт',0,'zero_ed_24/  KillerZera21'),(546049835401478154,'Mundotherapy','Золото 1',1500,'Саппорт','Топ','Лес','Мид','Бот',0,'wanna de chalandger'),(546421701878218753,'R4D1ON','Платина 4',1600,'Лес','Саппорт','Мид','Топ','Бот',0,'[[BIG SHOT!!!]]'),(555031963518631936,'eatmean','Платина 4',1600,'Саппорт','Бот','Лес','Мид','Топ',0,'эль кобочячос'),(574240083696418837,'15 YO L9 EMOBOY','Мастер+',2500,'Топ','Мид','Бот','Лес','Саппорт',0,'Flaivy'),(595170492139307018,'Финн Пaрнишкa','Платина 3',1700,'Топ','Мид','Саппорт','Лес','Бот',0,'Артёмка не гей'),(596686015121588225,'Fallen649','Бронза 3',500,'Лес','Бот','Саппорт','Топ','Мид',0,'Fallen649'),(597410261808185354,'TiranPupka','Серебро 2',1000,'Топ','Лес','Мид','Саппорт','Бот',0,'TiranPupka'),(598834824685551626,'XxDinos','Золото 2',1400,'Мид','Топ','Лес','Саппорт','Бот',0,'goglard'),(604625535368298496,'w0nderfulman','Серебро 2',1000,'Саппорт','Бот','Топ','Мид','Лес',0,'w0nderfulman'),(619855973334384660,'Душное Чудовище','Золото 1',1500,'Лес','Топ','Мид','Саппорт','Бот',0,'RobiNN'),(627471897147211776,'Гарвел','Платина 4',1600,'Мид','Топ','Лес','Бот','Саппорт',0,'Jostkiy(mx)'),(647882829434191873,'RCT Yato','Золото 4',1200,'Топ','Мид','Лес','Бот','Саппорт',0,'Yato'),(656493838600241202,'XxЕноТxX','Платина 1',1900,'Лес','Топ','Саппорт','Мид','Бот',0,'_angrytea_'),(663794913741242368,'FLollipop','Бронза 3',500,'Мид','Саппорт','Бот','Топ','Лес',0,'FLollipop'),(680849343687032847,'Luzha Zhizhi','Платина 1',1900,'Топ','Саппорт','Лес','Мид','Бот',0,'Luzha Zhizhi'),(696414451250757653,'QuNL','Золото 4',1200,'Топ','Лес','Бот','Саппорт','Мид',0,'Джун младший'),(732259888503455784,'MotherLolia','Серебро 4',800,'Бот','Лес','Топ','Мид','Саппорт',0,'MotherLolia'),(737185807072231454,'BLIN OLEG','Золото 3',1300,'Бот','Саппорт','Мид','Топ','Лес',0,'yaebu'),(765899145550364733,'Anna Asakura','Серебро 1 ',1100,'Саппорт','Мид','Лес','Топ','Бот',0,'Anna Asakura'),(772563912041693235,'Blidun','Бронза 4',400,'Лес','Топ','Мид','Бот','Саппорт',0,'ХИХИХИ ХА'),(785050307301867522,'DIE4YOU','Серебро 3',900,'Бот','Лес','Мид','Саппорт','Топ',0,'OSKALIT'),(787364489837281280,'Dеd fеnrir','Золото 2',1400,'Бот','Топ','Лес','Мид','Саппорт',0,'dedfenrir'),(889174924978180137,'Recstoyn','Платина 3',1700,'Лес','Топ','Саппорт','Бот','Мид',0,'ternix'),(917832705859809310,'BorusoDie','Платина 1',1900,'Топ','Мид','Саппорт','Лес','Бот',0,'bopzou'),(934397371805216809,'17 elusive','Алмаз 2',2200,'Лес','Топ','Мид','Бот','Саппорт',0,'elusive9905'),(959278229988966410,'Неофит прайм','Золото 4',1200,'Топ','Саппорт','Бот','Мид','Лес',0,'Неофит прайм'),(960357850595598357,'Lampusha','Алмаз 3',2100,'Саппорт','Бот','Мид','Топ','Лес',0,'Еблуша');''')
        con.commit()

    except Error as e:
        error_code = e.args[0]
        print(f'Insert data in table users return error message: {error_code}')


con = sql_connection()
# slq_create_table(con)
# sql_insert_user(con)


# # Тестовые данные для команды и события
cursorObj = con.cursor()


cursorObj.execute('''
insert into team 
values (2, 'suglinca', 1, 'Ебушки2', 'Ебушки22', 1, 1, 1, 1)
''')
con.commit()

cursorObj.execute('''
insert into user_to_team 
values (2, 178963010751168512, 2, 'Njg')
''')
con.commit()

cursorObj.execute('''
insert into events 
values (2, '2023-08-13 20:00:00', '2023-08-13 20:00:00', 'RTC', 'Name2', 'desc2', '0', 1, 1, 1, 1, 1, 1)
''')
con.commit()

cursorObj.execute('''
insert into event_to_team 
values (2, 2, 2)
''')
con.commit()
